stressTest.yaml
config:
  target: "http://localhost:3000"
  phases:
    - duration: 60
      arrivalRate: 20
scenarios:
    - flow:
      - loop:
        - get:
            url: "/api/products/9000000/details"
        count: 20
      - loop:
        - get:
            url: "/api/products/9876543/questions"
        count: 20
      - loop:
        - get:
            url: "/api/products/9876534/answers"
        count: 20
      - post:
          url: "/api/products/10000000/questions"
          json:
            user_name: "testUser"
            question: "will this survive stress test?"
      - post:
          url: "/api/products/9786543/answers"
          json:
            question_id: 9000000
            user_name: "answerTestUser"
            answer: "this is an answer example"